; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	image4 - mode
	spectrograph0 - mode
	image5 - mode
	thermograph1 - mode
	spectrograph6 - mode
	infrared2 - mode
	infrared3 - mode
	Star0 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star7 - direction
	GroundStation9 - direction
	GroundStation10 - direction
	Star11 - direction
	GroundStation12 - direction
	GroundStation6 - direction
	GroundStation1 - direction
	GroundStation8 - direction
	GroundStation13 - direction
	Star5 - direction
	Star2 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 GroundStation12)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph6)
	(supports instrument1 image4)
	(supports instrument1 image5)
	(calibration_target instrument1 GroundStation13)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation13)
	(supports instrument2 thermograph1)
	(supports instrument2 spectrograph6)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 spectrograph0)
	(supports instrument3 infrared3)
	(supports instrument3 spectrograph6)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 GroundStation13)
	(calibration_target instrument3 GroundStation8)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet17)
)
(:goal (and
	(pointing satellite1 Star0)
	(have_image Phenomenon14 image5)
	(have_image Phenomenon14 image4)
	(have_image Phenomenon15 spectrograph0)
	(have_image Phenomenon15 infrared3)
	(have_image Phenomenon16 spectrograph0)
	(have_image Phenomenon16 infrared2)
	(have_image Planet17 spectrograph0)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 8
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 8
3. (calibrate satellite0 instrument1 groundstation13)
   added: (calibrated instrument1)
   goals met: 0 of 8
4. (turn_to satellite0 phenomenon14 groundstation13)
   deleted: (pointing satellite0 groundstation13)
   added: (pointing satellite0 phenomenon14)
   goals met: 0 of 8
5. (take_image satellite0 phenomenon14 instrument1 image4)
   added: (have_image phenomenon14 image4)
   goals met: 1 of 8
6. (take_image satellite0 phenomenon14 instrument1 image5)
   added: (have_image phenomenon14 image5)
   goals met: 2 of 8
7. (turn_to satellite0 phenomenon16 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon16)
   goals met: 2 of 8
8. (take_image satellite0 phenomenon16 instrument1 infrared2)
   added: (have_image phenomenon16 infrared2)
   goals met: 3 of 8
9. (turn_to satellite1 star5 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 star5)
   goals met: 3 of 8
10. (calibrate satellite1 instrument3 star5)
   added: (calibrated instrument3)
   goals met: 3 of 8
11. (turn_to satellite1 phenomenon15 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 phenomenon15)
   goals met: 3 of 8
12. (take_image satellite1 phenomenon15 instrument3 infrared3)
   added: (have_image phenomenon15 infrared3)
   goals met: 4 of 8
13. (take_image satellite1 phenomenon15 instrument3 spectrograph0)
   added: (have_image phenomenon15 spectrograph0)
   goals met: 5 of 8
14. (turn_to satellite1 phenomenon16 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon16)
   goals met: 5 of 8
15. (take_image satellite1 phenomenon16 instrument3 spectrograph0)
   added: (have_image phenomenon16 spectrograph0)
   goals met: 6 of 8
16. (turn_to satellite1 planet17 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 planet17)
   goals met: 6 of 8
17. (take_image satellite1 planet17 instrument3 spectrograph0)
   added: (have_image planet17 spectrograph0)
   goals met: 7 of 8
18. (turn_to satellite1 star0 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 star0)
   goals met: 8 of 8
